Autodesk.Revit.DB.IFCUserDefinedProperty.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFCUserDefinedProperty.DataTypeDefined
The defined value data type of the table property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.PropertyType
The type of the property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.DataType
The data type of the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.RevitPropertyName
The Revit property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.RevitPropertyId
The Revit property id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.IFCPropertyName
The IFC property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.#ctor(System.String,Autodesk.Revit.DB.ElementId,System.String,System.String,Autodesk.Revit.DB.IFCUserDefinedPropertyType,System.String)
Constructs a new IFCUserDefinedProperty with input values.
The property name.
The Revit property id.
The Revit property name.
The data type of the property.
The type of the property.
The defined value data type of the table property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty.#ctor
Constructs a new IFCUserDefinedProperty with default values.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedProperty
Represents the IFC property stored in the property set.
Since:
2027